SaitovSP/src/Catalogs/СкидочныеКарты/СкидочныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидочныеКарты</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартуВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>CatalogRef.ТипыКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/Catalogs/СкидочныеКарты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Дата = '00010101' Тогда 
		Дата = ТекущаяДата();
		КартуВыдал = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
   	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидочныеКарты.Ссылка КАК Ссылка,
		|	СкидочныеКарты.ВерсияДанных КАК ВерсияДанных,
		|	СкидочныеКарты.ПометкаУдаления КАК ПометкаУдаления,
		|	СкидочныеКарты.Код КАК Код,
		|	СкидочныеКарты.Клиент КАК Клиент,
		|	СкидочныеКарты.Дата КАК Дата,
		|	СкидочныеКарты.КартуВыдал КАК КартуВыдал,
		|	СкидочныеКарты.ТипКарты КАК ТипКарты,
		|	СкидочныеКарты.Размер КАК Размер,
		|	СкидочныеКарты.Предопределенный КАК Предопределенный,
		|	СкидочныеКарты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.СкидочныеКарты КАК СкидочныеКарты
		|ГДЕ
		|	СкидочныеКарты.Клиент = &Клиент
		|	И СкидочныеКарты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;    
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		Сообщить("у КЛИЕНТА КАРТА уже есть");
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры
